RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_DMA0_AWR_LAT_SAWL_MASK              (0xFFFFFFFFU)
#define CAAM_DMA0_AWR_LAT_SAWL_SHIFT             (0U)
#define CAAM_DMA0_AWR_LAT_SAWL(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DMA0_AWR_LAT_SAWL_SHIFT)) & CAAM_DMA0_AWR_LAT_SAWL_MASK)
/*! @} */

/*! @name MPPKR - Manufacturing Protection Private Key Register */
/*! @{ */

#define CAAM_MPPKR_MPPrivK_MASK                  (0xFFU)
#define CAAM_MPPKR_MPPrivK_SHIFT                 (0U)
#define CAAM_MPPKR_MPPrivK(x)                    (((uint8_t)(((uint8_t)(x)) << CAAM_MPPKR_MPPrivK_SHIFT)) & CAAM_MPPKR_MPPrivK_MASK)
/*! @} */

/* The count of CAAM_MPPKR */
#define CAAM_MPPKR_COUNT                         (64U)

/*! @name MPMR - Manufacturing Protection Message Register */
/*! @{ */

#define CAAM_MPMR_MPMSG_MASK                     (0xFFU)
#define CAAM_MPMR_MPMSG_SHIFT                    (0U)
#define CAAM_MPMR_MPMSG(x)                       (((uint8_t)(((uint8_t)(x)) << CAAM_MPMR_MPMSG_SHIFT)) & CAAM_MPMR_MPMSG_MASK)
/*! @} */

/* The count of CAAM_MPMR */
#define CAAM_MPMR_COUNT                          (32U)

/*! @name MPTESTR - Manufacturing Protection Test Register */
/*! @{ */

#define CAAM_MPTESTR_TEST_VALUE_MASK             (0xFFU)
#define CAAM_MPTESTR_TEST_VALUE_SHIFT            (0U)
#define CAAM_MPTESTR_TEST_VALUE(x)               (((uint8_t)(((uint8_t)(x)) << CAAM_MPTESTR_TEST_VALUE_SHIFT)) & CAAM_MPTESTR_TEST_VALUE_MASK)
/*! @} */

/* The count of CAAM_MPTESTR */
#define CAAM_MPTESTR_COUNT                       (32U)

/*! @name MPECC - Manufacturing Protection ECC Register */
/*! @{ */

#define CAAM_MPECC_MP_SYNDROME_MASK              (0x1FF0000U)
#define CAAM_MPECC_MP_SYNDROME_SHIFT             (16U)
/*! MP_SYNDROME
 *  0b000000000..The MP Key in the SFP passes the ECC check.
 *  0b000000001-0b111111111..The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.
 */
#define CAAM_MPECC_MP_SYNDROME(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_MPECC_MP_SYNDROME_SHIFT)) & CAAM_MPECC_MP_SYNDROME_MASK)

#define CAAM_MPECC_MP_ZERO_MASK                  (0x8000000U)
#define CAAM_MPECC_MP_ZERO_SHIFT                 (27U)
/*! MP_ZERO
 *  0b0..The MP Key in the SFP has a non-zero value.
 *  0b1..The MP Key in the SFP is all zeros (unprogrammed).
 */
#define CAAM_MPECC_MP_ZERO(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_MPECC_MP_ZERO_SHIFT)) & CAAM_MPECC_MP_ZERO_MASK)
/*! @} */

/*! @name JDKEKR - Job Descriptor Key Encryption Key Register */
/*! @{ */

#define CAAM_JDKEKR_JDKEK_MASK                   (0xFFFFFFFFU)
#define CAAM_JDKEKR_JDKEK_SHIFT                  (0U)
#define CAAM_JDKEKR_JDKEK(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_JDKEKR_JDKEK_SHIFT)) & CAAM_JDKEKR_JDKEK_MASK)
/*! @} */

/* The count of CAAM_JDKEKR */
#define CAAM_JDKEKR_COUNT                        (8U)

/*! @name TDKEKR - Trusted Descriptor Key Encryption Key Register */
/*! @{ */

#define CAAM_TDKEKR_TDKEK_MASK                   (0xFFFFFFFFU)
#define CAAM_TDKEKR_TDKEK_SHIFT                  (0U)
#define CAAM_TDKEKR_TDKEK(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_TDKEKR_TDKEK_SHIFT)) & CAAM_TDKEKR_TDKEK_MASK)
/*! @} */

/* The count of CAAM_TDKEKR */
#define CAAM_TDKEKR_COUNT                        (8U)

/*! @name TDSKR - Trusted Descriptor Signing Key Register */
/*! @{ */

#define CAAM_TDSKR_TDSK_MASK                     (0xFFFFFFFFU)
#define CAAM_TDSKR_TDSK_SHIFT                    (0U)
#define CAAM_TDSKR_TDSK(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_TDSKR_TDSK_SHIFT)) & CAAM_TDSKR_TDSK_MASK)
/*! @} */

/* The count of CAAM_TDSKR */
#define CAAM_TDSKR_COUNT                         (8U)

/*! @name SKNR - Secure Key Nonce Register */
/*! @{ */

#define CAAM_SKNR_SK_NONCE_LS_MASK               (0xFFFFFFFFU)
#define CAAM_SKNR_SK_NONCE_LS_SHIFT              (0U)
#define CAAM_SKNR_SK_NONCE_LS(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_SKNR_SK_NONCE_LS_SHIFT)) & CAAM_SKNR_SK_NONCE_LS_MASK)

#define CAAM_SKNR_SK_NONCE_MS_MASK               (0x7FFF00000000U)
#define CAAM_SKNR_SK_NONCE_MS_SHIFT              (32U)
#define CAAM_SKNR_SK_NONCE_MS(x)                 (((uint64_t)(((uint64_t)(x)) << CAAM_SKNR_SK_NONCE_MS_SHIFT)) & CAAM_SKNR_SK_NONCE_MS_MASK)
/*! @} */

/*! @name DMA_STA - DMA Status Register */
/*! @{ */

#define CAAM_DMA_STA_DMA0_ETIF_MASK              (0x1FU)
#define CAAM_DMA_STA_DMA0_ETIF_SHIFT             (0U)
#define CAAM_DMA_STA_DMA0_ETIF(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_STA_DMA0_ETIF_SHIFT)) & CAAM_DMA_STA_DMA0_ETIF_MASK)

#define CAAM_DMA_STA_DMA0_ITIF_MASK              (0x20U)
#define CAAM_DMA_STA_DMA0_ITIF_SHIFT             (5U)
#define CAAM_DMA_STA_DMA0_ITIF(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_STA_DMA0_ITIF_SHIFT)) & CAAM_DMA_STA_DMA0_ITIF_MASK)

#define CAAM_DMA_STA_DMA0_IDLE_MASK              (0x80U)
#define CAAM_DMA_STA_DMA0_IDLE_SHIFT             (7U)
#define CAAM_DMA_STA_DMA0_IDLE(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_STA_DMA0_IDLE_SHIFT)) & CAAM_DMA_STA_DMA0_IDLE_MASK)
/*! @} */

/*! @name DMA_X_AID_7_4_MAP - DMA_X_AID_7_4_MAP */
/*! @{ */

#define CAAM_DMA_X_AID_7_4_MAP_AID4_BID_MASK     (0xFFU)
#define CAAM_DMA_X_AID_7_4_MAP_AID4_BID_SHIFT    (0U)
#define CAAM_DMA_X_AID_7_4_MAP_AID4_BID(x)       (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AID_7_4_MAP_AID4_BID_SHIFT)) & CAAM_DMA_X_AID_7_4_MAP_AID4_BID_MASK)

#define CAAM_DMA_X_AID_7_4_MAP_AID5_BID_MASK     (0xFF00U)
#define CAAM_DMA_X_AID_7_4_MAP_AID5_BID_SHIFT    (8U)
#define CAAM_DMA_X_AID_7_4_MAP_AID5_BID(x)       (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AID_7_4_MAP_AID5_BID_SHIFT)) & CAAM_DMA_X_AID_7_4_MAP_AID5_BID_MASK)

#define CAAM_DMA_X_AID_7_4_MAP_AID6_BID_MASK     (0xFF0000U)
#define CAAM_DMA_X_AID_7_4_MAP_AID6_BID_SHIFT    (16U)
#define CAAM_DMA_X_AID_7_4_MAP_AID6_BID(x)       (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AID_7_4_MAP_AID6_BID_SHIFT)) & CAAM_DMA_X_AID_7_4_MAP_AID6_BID_MASK)

