RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_HT_JD_ADDR_JD_ADDR_MASK             (0xFFFFFFFFFU)
#define CAAM_HT_JD_ADDR_JD_ADDR_SHIFT            (0U)
#define CAAM_HT_JD_ADDR_JD_ADDR(x)               (((uint64_t)(((uint64_t)(x)) << CAAM_HT_JD_ADDR_JD_ADDR_SHIFT)) & CAAM_HT_JD_ADDR_JD_ADDR_MASK)
/*! @} */

/* The count of CAAM_HT_JD_ADDR */
#define CAAM_HT_JD_ADDR_COUNT                    (1U)

/*! @name HT_SD_ADDR - Holding Tank 0 Shared Descriptor Address */
/*! @{ */

#define CAAM_HT_SD_ADDR_SD_ADDR_MASK             (0xFFFFFFFFFU)
#define CAAM_HT_SD_ADDR_SD_ADDR_SHIFT            (0U)
#define CAAM_HT_SD_ADDR_SD_ADDR(x)               (((uint64_t)(((uint64_t)(x)) << CAAM_HT_SD_ADDR_SD_ADDR_SHIFT)) & CAAM_HT_SD_ADDR_SD_ADDR_MASK)
/*! @} */

/* The count of CAAM_HT_SD_ADDR */
#define CAAM_HT_SD_ADDR_COUNT                    (1U)

/*! @name HT_JQ_CTRL_MS - Holding Tank 0 Job Queue Control, most-significant half */
/*! @{ */

#define CAAM_HT_JQ_CTRL_MS_ID_MASK               (0x7U)
#define CAAM_HT_JQ_CTRL_MS_ID_SHIFT              (0U)
#define CAAM_HT_JQ_CTRL_MS_ID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_ID_SHIFT)) & CAAM_HT_JQ_CTRL_MS_ID_MASK)

#define CAAM_HT_JQ_CTRL_MS_SRC_MASK              (0x700U)
#define CAAM_HT_JQ_CTRL_MS_SRC_SHIFT             (8U)
/*! SRC
 *  0b000..Job Ring 0
 *  0b001..Job Ring 1
 *  0b010..Job Ring 2
 *  0b011..Job Ring 3
 *  0b100..RTIC
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..Reserved
 */
#define CAAM_HT_JQ_CTRL_MS_SRC(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_SRC_SHIFT)) & CAAM_HT_JQ_CTRL_MS_SRC_MASK)

#define CAAM_HT_JQ_CTRL_MS_JDDS_MASK             (0x4000U)
#define CAAM_HT_JQ_CTRL_MS_JDDS_SHIFT            (14U)
/*! JDDS
 *  0b0..Non-SEQ DID
 *  0b1..SEQ DID
 */
#define CAAM_HT_JQ_CTRL_MS_JDDS(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_JDDS_SHIFT)) & CAAM_HT_JQ_CTRL_MS_JDDS_MASK)

#define CAAM_HT_JQ_CTRL_MS_AMTD_MASK             (0x8000U)
#define CAAM_HT_JQ_CTRL_MS_AMTD_SHIFT            (15U)
#define CAAM_HT_JQ_CTRL_MS_AMTD(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_AMTD_SHIFT)) & CAAM_HT_JQ_CTRL_MS_AMTD_MASK)

#define CAAM_HT_JQ_CTRL_MS_SOB_MASK              (0x10000U)
#define CAAM_HT_JQ_CTRL_MS_SOB_SHIFT             (16U)
#define CAAM_HT_JQ_CTRL_MS_SOB(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_SOB_SHIFT)) & CAAM_HT_JQ_CTRL_MS_SOB_MASK)

#define CAAM_HT_JQ_CTRL_MS_HT_ERROR_MASK         (0x60000U)
#define CAAM_HT_JQ_CTRL_MS_HT_ERROR_SHIFT        (17U)
/*! HT_ERROR
 *  0b00..No error
 *  0b01..Job Descriptor or Shared Descriptor length error
 *  0b10..AXI_error while reading a Job Ring Shared Descriptor or the remainder of a Job Ring Job Descriptor
 *  0b11..reserved
 */
#define CAAM_HT_JQ_CTRL_MS_HT_ERROR(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_HT_ERROR_SHIFT)) & CAAM_HT_JQ_CTRL_MS_HT_ERROR_MASK)

#define CAAM_HT_JQ_CTRL_MS_DWORD_SWAP_MASK       (0x80000U)
#define CAAM_HT_JQ_CTRL_MS_DWORD_SWAP_SHIFT      (19U)
/*! DWORD_SWAP
 *  0b0..DWords are in the order most-significant word, least-significant word.
 *  0b1..DWords are in the order least-significant word, most-significant word.
 */
#define CAAM_HT_JQ_CTRL_MS_DWORD_SWAP(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_DWORD_SWAP_SHIFT)) & CAAM_HT_JQ_CTRL_MS_DWORD_SWAP_MASK)

#define CAAM_HT_JQ_CTRL_MS_SHR_FROM_MASK         (0x7C00000U)
#define CAAM_HT_JQ_CTRL_MS_SHR_FROM_SHIFT        (22U)
#define CAAM_HT_JQ_CTRL_MS_SHR_FROM(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_SHR_FROM_SHIFT)) & CAAM_HT_JQ_CTRL_MS_SHR_FROM_MASK)

#define CAAM_HT_JQ_CTRL_MS_ILE_MASK              (0x8000000U)
#define CAAM_HT_JQ_CTRL_MS_ILE_SHIFT             (27U)
/*! ILE
 *  0b0..No byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.
 *  0b1..Byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.
 */
#define CAAM_HT_JQ_CTRL_MS_ILE(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_ILE_SHIFT)) & CAAM_HT_JQ_CTRL_MS_ILE_MASK)

#define CAAM_HT_JQ_CTRL_MS_FOUR_MASK             (0x10000000U)
#define CAAM_HT_JQ_CTRL_MS_FOUR_SHIFT            (28U)
#define CAAM_HT_JQ_CTRL_MS_FOUR(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_FOUR_SHIFT)) & CAAM_HT_JQ_CTRL_MS_FOUR_MASK)

#define CAAM_HT_JQ_CTRL_MS_WHL_MASK              (0x20000000U)
#define CAAM_HT_JQ_CTRL_MS_WHL_SHIFT             (29U)
#define CAAM_HT_JQ_CTRL_MS_WHL(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_MS_WHL_SHIFT)) & CAAM_HT_JQ_CTRL_MS_WHL_MASK)
/*! @} */

/* The count of CAAM_HT_JQ_CTRL_MS */
#define CAAM_HT_JQ_CTRL_MS_COUNT                 (1U)

/*! @name HT_JQ_CTRL_LS - Holding Tank 0 Job Queue Control, least-significant half */
/*! @{ */

#define CAAM_HT_JQ_CTRL_LS_PRIM_DID_MASK         (0xFU)
#define CAAM_HT_JQ_CTRL_LS_PRIM_DID_SHIFT        (0U)
#define CAAM_HT_JQ_CTRL_LS_PRIM_DID(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_LS_PRIM_DID_SHIFT)) & CAAM_HT_JQ_CTRL_LS_PRIM_DID_MASK)

#define CAAM_HT_JQ_CTRL_LS_PRIM_TZ_MASK          (0x10U)
#define CAAM_HT_JQ_CTRL_LS_PRIM_TZ_SHIFT         (4U)
/*! PRIM_TZ
 *  0b0..TrustZone NonSecureWorld
 *  0b1..TrustZone SecureWorld
 */
#define CAAM_HT_JQ_CTRL_LS_PRIM_TZ(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_LS_PRIM_TZ_SHIFT)) & CAAM_HT_JQ_CTRL_LS_PRIM_TZ_MASK)

#define CAAM_HT_JQ_CTRL_LS_PRIM_ICID_MASK        (0xFFE0U)
#define CAAM_HT_JQ_CTRL_LS_PRIM_ICID_SHIFT       (5U)
#define CAAM_HT_JQ_CTRL_LS_PRIM_ICID(x)          (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_LS_PRIM_ICID_SHIFT)) & CAAM_HT_JQ_CTRL_LS_PRIM_ICID_MASK)

#define CAAM_HT_JQ_CTRL_LS_OUT_DID_MASK          (0xF0000U)
#define CAAM_HT_JQ_CTRL_LS_OUT_DID_SHIFT         (16U)
#define CAAM_HT_JQ_CTRL_LS_OUT_DID(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_LS_OUT_DID_SHIFT)) & CAAM_HT_JQ_CTRL_LS_OUT_DID_MASK)

#define CAAM_HT_JQ_CTRL_LS_OUT_ICID_MASK         (0xFFE00000U)
#define CAAM_HT_JQ_CTRL_LS_OUT_ICID_SHIFT        (21U)
#define CAAM_HT_JQ_CTRL_LS_OUT_ICID(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_HT_JQ_CTRL_LS_OUT_ICID_SHIFT)) & CAAM_HT_JQ_CTRL_LS_OUT_ICID_MASK)
/*! @} */

/* The count of CAAM_HT_JQ_CTRL_LS */
#define CAAM_HT_JQ_CTRL_LS_COUNT                 (1U)

/*! @name HT_STATUS - Holding Tank Status */
/*! @{ */

#define CAAM_HT_STATUS_PEND_0_MASK               (0x1U)
#define CAAM_HT_STATUS_PEND_0_SHIFT              (0U)
#define CAAM_HT_STATUS_PEND_0(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_HT_STATUS_PEND_0_SHIFT)) & CAAM_HT_STATUS_PEND_0_MASK)

#define CAAM_HT_STATUS_IN_USE_MASK               (0x40000000U)
#define CAAM_HT_STATUS_IN_USE_SHIFT              (30U)
#define CAAM_HT_STATUS_IN_USE(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_HT_STATUS_IN_USE_SHIFT)) & CAAM_HT_STATUS_IN_USE_MASK)

#define CAAM_HT_STATUS_BC_MASK                   (0x80000000U)
#define CAAM_HT_STATUS_BC_SHIFT                  (31U)
#define CAAM_HT_STATUS_BC(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_HT_STATUS_BC_SHIFT)) & CAAM_HT_STATUS_BC_MASK)
/*! @} */

