RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_CRNR_LS_SNW8RN_MASK                 (0xF00000U)
#define CAAM_CRNR_LS_SNW8RN_SHIFT                (20U)
#define CAAM_CRNR_LS_SNW8RN(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_SNW8RN_SHIFT)) & CAAM_CRNR_LS_SNW8RN_MASK)

#define CAAM_CRNR_LS_KASRN_MASK                  (0xF000000U)
#define CAAM_CRNR_LS_KASRN_SHIFT                 (24U)
#define CAAM_CRNR_LS_KASRN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_KASRN_SHIFT)) & CAAM_CRNR_LS_KASRN_MASK)

#define CAAM_CRNR_LS_PKRN_MASK                   (0xF0000000U)
#define CAAM_CRNR_LS_PKRN_SHIFT                  (28U)
/*! PKRN
 *  0b0000..PKHA-SDv1
 *  0b0001..PKHA-SDv2
 *  0b0010..PKHA-SDv3
 *  0b0011..PKHA-SDv4
 */
#define CAAM_CRNR_LS_PKRN(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_PKRN_SHIFT)) & CAAM_CRNR_LS_PKRN_MASK)
/*! @} */

/*! @name CTPR_MS - Compile Time Parameters Register, most-significant half */
/*! @{ */

#define CAAM_CTPR_MS_VIRT_EN_INCL_MASK           (0x1U)
#define CAAM_CTPR_MS_VIRT_EN_INCL_SHIFT          (0U)
#define CAAM_CTPR_MS_VIRT_EN_INCL(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_VIRT_EN_INCL_SHIFT)) & CAAM_CTPR_MS_VIRT_EN_INCL_MASK)

#define CAAM_CTPR_MS_VIRT_EN_POR_VALUE_MASK      (0x2U)
#define CAAM_CTPR_MS_VIRT_EN_POR_VALUE_SHIFT     (1U)
#define CAAM_CTPR_MS_VIRT_EN_POR_VALUE(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_VIRT_EN_POR_VALUE_SHIFT)) & CAAM_CTPR_MS_VIRT_EN_POR_VALUE_MASK)

#define CAAM_CTPR_MS_REG_PG_SIZE_MASK            (0x10U)
#define CAAM_CTPR_MS_REG_PG_SIZE_SHIFT           (4U)
#define CAAM_CTPR_MS_REG_PG_SIZE(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_REG_PG_SIZE_SHIFT)) & CAAM_CTPR_MS_REG_PG_SIZE_MASK)

#define CAAM_CTPR_MS_RNG_I_MASK                  (0x700U)
#define CAAM_CTPR_MS_RNG_I_SHIFT                 (8U)
#define CAAM_CTPR_MS_RNG_I(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_RNG_I_SHIFT)) & CAAM_CTPR_MS_RNG_I_MASK)

#define CAAM_CTPR_MS_AI_INCL_MASK                (0x800U)
#define CAAM_CTPR_MS_AI_INCL_SHIFT               (11U)
#define CAAM_CTPR_MS_AI_INCL(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_AI_INCL_SHIFT)) & CAAM_CTPR_MS_AI_INCL_MASK)

#define CAAM_CTPR_MS_DPAA2_MASK                  (0x2000U)
#define CAAM_CTPR_MS_DPAA2_SHIFT                 (13U)
#define CAAM_CTPR_MS_DPAA2(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_DPAA2_SHIFT)) & CAAM_CTPR_MS_DPAA2_MASK)

#define CAAM_CTPR_MS_IP_CLK_MASK                 (0x4000U)
#define CAAM_CTPR_MS_IP_CLK_SHIFT                (14U)
#define CAAM_CTPR_MS_IP_CLK(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_IP_CLK_SHIFT)) & CAAM_CTPR_MS_IP_CLK_MASK)

#define CAAM_CTPR_MS_MCFG_BURST_MASK             (0x10000U)
#define CAAM_CTPR_MS_MCFG_BURST_SHIFT            (16U)
#define CAAM_CTPR_MS_MCFG_BURST(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_MCFG_BURST_SHIFT)) & CAAM_CTPR_MS_MCFG_BURST_MASK)

#define CAAM_CTPR_MS_MCFG_PS_MASK                (0x20000U)
#define CAAM_CTPR_MS_MCFG_PS_SHIFT               (17U)
#define CAAM_CTPR_MS_MCFG_PS(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_MCFG_PS_SHIFT)) & CAAM_CTPR_MS_MCFG_PS_MASK)

#define CAAM_CTPR_MS_SG8_MASK                    (0x40000U)
#define CAAM_CTPR_MS_SG8_SHIFT                   (18U)
#define CAAM_CTPR_MS_SG8(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_SG8_SHIFT)) & CAAM_CTPR_MS_SG8_MASK)

#define CAAM_CTPR_MS_PM_EVT_BUS_MASK             (0x80000U)
#define CAAM_CTPR_MS_PM_EVT_BUS_SHIFT            (19U)
#define CAAM_CTPR_MS_PM_EVT_BUS(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_PM_EVT_BUS_SHIFT)) & CAAM_CTPR_MS_PM_EVT_BUS_MASK)

#define CAAM_CTPR_MS_DECO_WD_MASK                (0x100000U)
#define CAAM_CTPR_MS_DECO_WD_SHIFT               (20U)
#define CAAM_CTPR_MS_DECO_WD(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_DECO_WD_SHIFT)) & CAAM_CTPR_MS_DECO_WD_MASK)

#define CAAM_CTPR_MS_PC_MASK                     (0x200000U)
#define CAAM_CTPR_MS_PC_SHIFT                    (21U)
#define CAAM_CTPR_MS_PC(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_PC_SHIFT)) & CAAM_CTPR_MS_PC_MASK)

#define CAAM_CTPR_MS_C1C2_MASK                   (0x800000U)
#define CAAM_CTPR_MS_C1C2_SHIFT                  (23U)
#define CAAM_CTPR_MS_C1C2(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_C1C2_SHIFT)) & CAAM_CTPR_MS_C1C2_MASK)

#define CAAM_CTPR_MS_ACC_CTL_MASK                (0x1000000U)
#define CAAM_CTPR_MS_ACC_CTL_SHIFT               (24U)
#define CAAM_CTPR_MS_ACC_CTL(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_ACC_CTL_SHIFT)) & CAAM_CTPR_MS_ACC_CTL_MASK)

#define CAAM_CTPR_MS_QI_MASK                     (0x2000000U)
#define CAAM_CTPR_MS_QI_SHIFT                    (25U)
#define CAAM_CTPR_MS_QI(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_QI_SHIFT)) & CAAM_CTPR_MS_QI_MASK)

#define CAAM_CTPR_MS_AXI_PRI_MASK                (0x4000000U)
#define CAAM_CTPR_MS_AXI_PRI_SHIFT               (26U)
#define CAAM_CTPR_MS_AXI_PRI(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_AXI_PRI_SHIFT)) & CAAM_CTPR_MS_AXI_PRI_MASK)

#define CAAM_CTPR_MS_AXI_LIODN_MASK              (0x8000000U)
#define CAAM_CTPR_MS_AXI_LIODN_SHIFT             (27U)
#define CAAM_CTPR_MS_AXI_LIODN(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_AXI_LIODN_SHIFT)) & CAAM_CTPR_MS_AXI_LIODN_MASK)

#define CAAM_CTPR_MS_AXI_PIPE_DEPTH_MASK         (0xF0000000U)
#define CAAM_CTPR_MS_AXI_PIPE_DEPTH_SHIFT        (28U)
#define CAAM_CTPR_MS_AXI_PIPE_DEPTH(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_MS_AXI_PIPE_DEPTH_SHIFT)) & CAAM_CTPR_MS_AXI_PIPE_DEPTH_MASK)
/*! @} */

/*! @name CTPR_LS - Compile Time Parameters Register, least-significant half */
/*! @{ */

#define CAAM_CTPR_LS_KG_DS_MASK                  (0x1U)
#define CAAM_CTPR_LS_KG_DS_SHIFT                 (0U)
/*! KG_DS
 *  0b0..CAAM does not implement specialized support for Public Key Generation and Digital Signatures.
 *  0b1..CAAM implements specialized support for Public Key Generation and Digital Signatures.
 */
#define CAAM_CTPR_LS_KG_DS(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_KG_DS_SHIFT)) & CAAM_CTPR_LS_KG_DS_MASK)

