RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_CTPR_LS_BLOB_MASK                   (0x2U)
#define CAAM_CTPR_LS_BLOB_SHIFT                  (1U)
/*! BLOB
 *  0b0..CAAM does not implement specialized support for encapsulating and decapsulating cryptographic blobs.
 *  0b1..CAAM implements specialized support for encapsulating and decapsulating cryptographic blobs.
 */
#define CAAM_CTPR_LS_BLOB(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_BLOB_SHIFT)) & CAAM_CTPR_LS_BLOB_MASK)

#define CAAM_CTPR_LS_WIFI_MASK                   (0x4U)
#define CAAM_CTPR_LS_WIFI_SHIFT                  (2U)
/*! WIFI
 *  0b0..CAAM does not implement specialized support for the WIFI protocol.
 *  0b1..CAAM implements specialized support for the WIFI protocol.
 */
#define CAAM_CTPR_LS_WIFI(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_WIFI_SHIFT)) & CAAM_CTPR_LS_WIFI_MASK)

#define CAAM_CTPR_LS_WIMAX_MASK                  (0x8U)
#define CAAM_CTPR_LS_WIMAX_SHIFT                 (3U)
/*! WIMAX
 *  0b0..CAAM does not implement specialized support for the WIMAX protocol.
 *  0b1..CAAM implements specialized support for the WIMAX protocol.
 */
#define CAAM_CTPR_LS_WIMAX(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_WIMAX_SHIFT)) & CAAM_CTPR_LS_WIMAX_MASK)

#define CAAM_CTPR_LS_SRTP_MASK                   (0x10U)
#define CAAM_CTPR_LS_SRTP_SHIFT                  (4U)
/*! SRTP
 *  0b0..CAAM does not implement specialized support for the SRTP protocol.
 *  0b1..CAAM implements specialized support for the SRTP protocol.
 */
#define CAAM_CTPR_LS_SRTP(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_SRTP_SHIFT)) & CAAM_CTPR_LS_SRTP_MASK)

#define CAAM_CTPR_LS_IPSEC_MASK                  (0x20U)
#define CAAM_CTPR_LS_IPSEC_SHIFT                 (5U)
/*! IPSEC
 *  0b0..CAAM does not implement specialized support for the IPSEC protocol.
 *  0b1..CAAM implements specialized support for the IPSEC protocol.
 */
#define CAAM_CTPR_LS_IPSEC(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_IPSEC_SHIFT)) & CAAM_CTPR_LS_IPSEC_MASK)

#define CAAM_CTPR_LS_IKE_MASK                    (0x40U)
#define CAAM_CTPR_LS_IKE_SHIFT                   (6U)
/*! IKE
 *  0b0..CAAM does not implement specialized support for the IKE protocol.
 *  0b1..CAAM implements specialized support for the IKE protocol.
 */
#define CAAM_CTPR_LS_IKE(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_IKE_SHIFT)) & CAAM_CTPR_LS_IKE_MASK)

#define CAAM_CTPR_LS_SSL_TLS_MASK                (0x80U)
#define CAAM_CTPR_LS_SSL_TLS_SHIFT               (7U)
/*! SSL_TLS
 *  0b0..CAAM does not implement specialized support for the SSL and TLS protocols.
 *  0b1..CAAM implements specialized support for the SSL and TLS protocols.
 */
#define CAAM_CTPR_LS_SSL_TLS(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_SSL_TLS_SHIFT)) & CAAM_CTPR_LS_SSL_TLS_MASK)

#define CAAM_CTPR_LS_TLS_PRF_MASK                (0x100U)
#define CAAM_CTPR_LS_TLS_PRF_SHIFT               (8U)
/*! TLS_PRF
 *  0b0..CAAM does not implement specialized support for the TLS protocol pseudo-random function.
 *  0b1..CAAM implements specialized support for the TLS protocol pseudo-random function.
 */
#define CAAM_CTPR_LS_TLS_PRF(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_TLS_PRF_SHIFT)) & CAAM_CTPR_LS_TLS_PRF_MASK)

#define CAAM_CTPR_LS_MACSEC_MASK                 (0x200U)
#define CAAM_CTPR_LS_MACSEC_SHIFT                (9U)
/*! MACSEC
 *  0b0..CAAM does not implement specialized support for the MACSEC protocol.
 *  0b1..CAAM implements specialized support for the MACSEC protocol.
 */
#define CAAM_CTPR_LS_MACSEC(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_MACSEC_SHIFT)) & CAAM_CTPR_LS_MACSEC_MASK)

#define CAAM_CTPR_LS_RSA_MASK                    (0x400U)
#define CAAM_CTPR_LS_RSA_SHIFT                   (10U)
/*! RSA
 *  0b0..CAAM does not implement specialized support for RSA encrypt and decrypt operations.
 *  0b1..CAAM implements specialized support for RSA encrypt and decrypt operations.
 */
#define CAAM_CTPR_LS_RSA(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_RSA_SHIFT)) & CAAM_CTPR_LS_RSA_MASK)

#define CAAM_CTPR_LS_P3G_LTE_MASK                (0x800U)
#define CAAM_CTPR_LS_P3G_LTE_SHIFT               (11U)
/*! P3G_LTE
 *  0b0..CAAM does not implement specialized support for 3G and LTE protocols.
 *  0b1..CAAM implements specialized support for 3G and LTE protocols.
 */
#define CAAM_CTPR_LS_P3G_LTE(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_P3G_LTE_SHIFT)) & CAAM_CTPR_LS_P3G_LTE_MASK)

#define CAAM_CTPR_LS_DBL_CRC_MASK                (0x1000U)
#define CAAM_CTPR_LS_DBL_CRC_SHIFT               (12U)
/*! DBL_CRC
 *  0b0..CAAM does not implement specialized support for Double CRC.
 *  0b1..CAAM implements specialized support for Double CRC.
 */
#define CAAM_CTPR_LS_DBL_CRC(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_DBL_CRC_SHIFT)) & CAAM_CTPR_LS_DBL_CRC_MASK)

#define CAAM_CTPR_LS_MAN_PROT_MASK               (0x2000U)
#define CAAM_CTPR_LS_MAN_PROT_SHIFT              (13U)
/*! MAN_PROT
 *  0b0..CAAM does not implement Manufacturing Protection functions.
 *  0b1..CAAM implements Manufacturing Protection functions.
 */
#define CAAM_CTPR_LS_MAN_PROT(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_MAN_PROT_SHIFT)) & CAAM_CTPR_LS_MAN_PROT_MASK)

#define CAAM_CTPR_LS_DKP_MASK                    (0x4000U)
#define CAAM_CTPR_LS_DKP_SHIFT                   (14U)
/*! DKP
 *  0b0..CAAM does not implement the Derived Key Protocol.
 *  0b1..CAAM implements the Derived Key Protocol.
 */
#define CAAM_CTPR_LS_DKP(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CTPR_LS_DKP_SHIFT)) & CAAM_CTPR_LS_DKP_MASK)
/*! @} */

/*! @name SMSTA - Secure Memory Status Register */
/*! @{ */

#define CAAM_SMSTA_STATE_MASK                    (0xFU)
#define CAAM_SMSTA_STATE_SHIFT                   (0U)
/*! STATE
 *  0b0000..Reset State
 *  0b0001..Initialize State
 *  0b0010..Normal State
 *  0b0011..Fail State
 */
#define CAAM_SMSTA_STATE(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_STATE_SHIFT)) & CAAM_SMSTA_STATE_MASK)

#define CAAM_SMSTA_ACCERR_MASK                   (0xF0U)
#define CAAM_SMSTA_ACCERR_SHIFT                  (4U)
/*! ACCERR
 *  0b0000..No error occurred
 *  0b0001..A bus transaction attempted to access a page in Secure Memory, but the page was not allocated to any partition.
 *  0b0010..A bus transaction attempted to access a partition, but the transaction's TrustZone World, DID was not
 *          granted access to the partition in the partition's SMAG2/1JR registers.
 *  0b0011..A bus transaction attempted to read, but reads from this partition are not allowed.
 *  0b0100..A bus transaction attempted to write, but writes to this partition are not allowed.
 *  0b0110..A bus transaction attempted a non-key read, but the only reads permitted from this partition are key reads.
 *  0b1001..Secure Memory Blob import or export was attempted, but Secure Memory Blob access is not allowed for this partition.
 *  0b1010..A Descriptor attempted a Secure Memory Blob import or export, but not all of the pages referenced were from the same partition.
 *  0b1011..A memory access was directed to Secure Memory, but the specified address is not implemented in Secure
 *          Memory. The address was either outside the address range occupied by Secure Memory, or was within an
 *          unimplemented portion of the 4kbyte address block occupied by a 1Kbyte or 2Kbyte Secure Memory page.
 *  0b1100..A bus transaction was attempted, but the burst would have crossed a page boundary.
 *  0b1101..An attempt was made to access a page while it was still being initialized.
 */
#define CAAM_SMSTA_ACCERR(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SMSTA_ACCERR_SHIFT)) & CAAM_SMSTA_ACCERR_MASK)

