RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_REIR5RTIC_SAFE_MASK                 (0x1000000U)
#define CAAM_REIR5RTIC_SAFE_SHIFT                (24U)
#define CAAM_REIR5RTIC_SAFE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5RTIC_SAFE_SHIFT)) & CAAM_REIR5RTIC_SAFE_MASK)

#define CAAM_REIR5RTIC_SMA_MASK                  (0x2000000U)
#define CAAM_REIR5RTIC_SMA_SHIFT                 (25U)
#define CAAM_REIR5RTIC_SMA(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5RTIC_SMA_SHIFT)) & CAAM_REIR5RTIC_SMA_MASK)
/*! @} */

/*! @name CC1MR - CCB 0 Class 1 Mode Register Format for Non-Public Key Algorithms */
/*! @{ */

#define CAAM_CC1MR_ENC_MASK                      (0x1U)
#define CAAM_CC1MR_ENC_SHIFT                     (0U)
/*! ENC
 *  0b0..Decrypt.
 *  0b1..Encrypt.
 */
#define CAAM_CC1MR_ENC(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_ENC_SHIFT)) & CAAM_CC1MR_ENC_MASK)

#define CAAM_CC1MR_ICV_TEST_MASK                 (0x2U)
#define CAAM_CC1MR_ICV_TEST_SHIFT                (1U)
#define CAAM_CC1MR_ICV_TEST(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_ICV_TEST_SHIFT)) & CAAM_CC1MR_ICV_TEST_MASK)

#define CAAM_CC1MR_AS_MASK                       (0xCU)
#define CAAM_CC1MR_AS_SHIFT                      (2U)
/*! AS
 *  0b00..Update
 *  0b01..Initialize
 *  0b10..Finalize
 *  0b11..Initialize/Finalize
 */
#define CAAM_CC1MR_AS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_AS_SHIFT)) & CAAM_CC1MR_AS_MASK)

#define CAAM_CC1MR_AAI_MASK                      (0x1FF0U)
#define CAAM_CC1MR_AAI_SHIFT                     (4U)
#define CAAM_CC1MR_AAI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_AAI_SHIFT)) & CAAM_CC1MR_AAI_MASK)

#define CAAM_CC1MR_ALG_MASK                      (0xFF0000U)
#define CAAM_CC1MR_ALG_SHIFT                     (16U)
/*! ALG
 *  0b00010000..AES
 *  0b00100000..DES
 *  0b00100001..3DES
 *  0b01010000..RNG
 */
#define CAAM_CC1MR_ALG(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_ALG_SHIFT)) & CAAM_CC1MR_ALG_MASK)
/*! @} */

/* The count of CAAM_CC1MR */
#define CAAM_CC1MR_COUNT                         (1U)

/*! @name CC1MR_PK - CCB 0 Class 1 Mode Register Format for Public Key Algorithms */
/*! @{ */

#define CAAM_CC1MR_PK_PKHA_MODE_LS_MASK          (0xFFFU)
#define CAAM_CC1MR_PK_PKHA_MODE_LS_SHIFT         (0U)
#define CAAM_CC1MR_PK_PKHA_MODE_LS(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_PK_PKHA_MODE_LS_SHIFT)) & CAAM_CC1MR_PK_PKHA_MODE_LS_MASK)

#define CAAM_CC1MR_PK_PKHA_MODE_MS_MASK          (0xF0000U)
#define CAAM_CC1MR_PK_PKHA_MODE_MS_SHIFT         (16U)
#define CAAM_CC1MR_PK_PKHA_MODE_MS(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_PK_PKHA_MODE_MS_SHIFT)) & CAAM_CC1MR_PK_PKHA_MODE_MS_MASK)
/*! @} */

/* The count of CAAM_CC1MR_PK */
#define CAAM_CC1MR_PK_COUNT                      (1U)

/*! @name CC1MR_RNG - CCB 0 Class 1 Mode Register Format for RNG4 */
/*! @{ */

#define CAAM_CC1MR_RNG_TST_MASK                  (0x1U)
#define CAAM_CC1MR_RNG_TST_SHIFT                 (0U)
#define CAAM_CC1MR_RNG_TST(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_TST_SHIFT)) & CAAM_CC1MR_RNG_TST_MASK)

#define CAAM_CC1MR_RNG_PR_MASK                   (0x2U)
#define CAAM_CC1MR_RNG_PR_SHIFT                  (1U)
#define CAAM_CC1MR_RNG_PR(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_PR_SHIFT)) & CAAM_CC1MR_RNG_PR_MASK)

#define CAAM_CC1MR_RNG_AS_MASK                   (0xCU)
#define CAAM_CC1MR_RNG_AS_SHIFT                  (2U)
#define CAAM_CC1MR_RNG_AS(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_AS_SHIFT)) & CAAM_CC1MR_RNG_AS_MASK)

#define CAAM_CC1MR_RNG_SH_MASK                   (0x30U)
#define CAAM_CC1MR_RNG_SH_SHIFT                  (4U)
/*! SH
 *  0b00..State Handle 0
 *  0b01..State Handle 1
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CAAM_CC1MR_RNG_SH(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_SH_SHIFT)) & CAAM_CC1MR_RNG_SH_MASK)

#define CAAM_CC1MR_RNG_NZB_MASK                  (0x100U)
#define CAAM_CC1MR_RNG_NZB_SHIFT                 (8U)
/*! NZB
 *  0b0..Generate random data with all-zero bytes permitted.
 *  0b1..Generate random data without any all-zero bytes.
 */
#define CAAM_CC1MR_RNG_NZB(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_NZB_SHIFT)) & CAAM_CC1MR_RNG_NZB_MASK)

#define CAAM_CC1MR_RNG_OBP_MASK                  (0x200U)
#define CAAM_CC1MR_RNG_OBP_SHIFT                 (9U)
/*! OBP
 *  0b0..No odd byte parity.
 *  0b1..Generate random data with odd byte parity.
 */
#define CAAM_CC1MR_RNG_OBP(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_OBP_SHIFT)) & CAAM_CC1MR_RNG_OBP_MASK)

#define CAAM_CC1MR_RNG_PS_MASK                   (0x400U)
#define CAAM_CC1MR_RNG_PS_SHIFT                  (10U)
/*! PS
 *  0b0..No personalization string is included.
 *  0b1..A personalization string is included.
 */
#define CAAM_CC1MR_RNG_PS(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_PS_SHIFT)) & CAAM_CC1MR_RNG_PS_MASK)

#define CAAM_CC1MR_RNG_AI_MASK                   (0x800U)
#define CAAM_CC1MR_RNG_AI_SHIFT                  (11U)
/*! AI
 *  0b0..No additional entropy input has been provided.
 *  0b1..Additional entropy input has been provided.
 */
#define CAAM_CC1MR_RNG_AI(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_AI_SHIFT)) & CAAM_CC1MR_RNG_AI_MASK)

#define CAAM_CC1MR_RNG_SK_MASK                   (0x1000U)
#define CAAM_CC1MR_RNG_SK_SHIFT                  (12U)
/*! SK
 *  0b0..The destination for the RNG data is specified by the FIFO STORE command.
 *  0b1..The RNG data will go to the JDKEKR, TDKEKR and DSKR.
 */
#define CAAM_CC1MR_RNG_SK(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_SK_SHIFT)) & CAAM_CC1MR_RNG_SK_MASK)

#define CAAM_CC1MR_RNG_ALG_MASK                  (0xFF0000U)
#define CAAM_CC1MR_RNG_ALG_SHIFT                 (16U)
/*! ALG
 *  0b01010000..RNG
 */
#define CAAM_CC1MR_RNG_ALG(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC1MR_RNG_ALG_SHIFT)) & CAAM_CC1MR_RNG_ALG_MASK)
/*! @} */

