RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_CCCTRL_UB2_MASK                     (0x400000U)
#define CAAM_CCCTRL_UB2_SHIFT                    (22U)
/*! UB2
 *  0b0..Don't unload the PKHA B2 Memory.
 *  0b1..Unload the PKHA B2 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UB2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UB2_SHIFT)) & CAAM_CCCTRL_UB2_MASK)

#define CAAM_CCCTRL_UB3_MASK                     (0x800000U)
#define CAAM_CCCTRL_UB3_SHIFT                    (23U)
/*! UB3
 *  0b0..Don't unload the PKHA B3 Memory.
 *  0b1..Unload the PKHA B3 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UB3(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UB3_SHIFT)) & CAAM_CCCTRL_UB3_MASK)

#define CAAM_CCCTRL_UN_MASK                      (0x1000000U)
#define CAAM_CCCTRL_UN_SHIFT                     (24U)
/*! UN
 *  0b0..Don't unload the PKHA N Memory.
 *  0b1..Unload the PKHA N Memory into OFIFO.
 */
#define CAAM_CCCTRL_UN(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UN_SHIFT)) & CAAM_CCCTRL_UN_MASK)

#define CAAM_CCCTRL_UA_MASK                      (0x4000000U)
#define CAAM_CCCTRL_UA_SHIFT                     (26U)
/*! UA
 *  0b0..Don't unload the PKHA A Memory.
 *  0b1..Unload the PKHA A Memory into OFIFO.
 */
#define CAAM_CCCTRL_UA(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UA_SHIFT)) & CAAM_CCCTRL_UA_MASK)

#define CAAM_CCCTRL_UB_MASK                      (0x8000000U)
#define CAAM_CCCTRL_UB_SHIFT                     (27U)
/*! UB
 *  0b0..Don't unload the PKHA B Memory.
 *  0b1..Unload the PKHA B Memory into OFIFO.
 */
#define CAAM_CCCTRL_UB(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UB_SHIFT)) & CAAM_CCCTRL_UB_MASK)
/*! @} */

/* The count of CAAM_CCCTRL */
#define CAAM_CCCTRL_COUNT                        (1U)

/*! @name CICTL - CCB 0 Interrupt Control Register */
/*! @{ */

#define CAAM_CICTL_ADI_MASK                      (0x2U)
#define CAAM_CICTL_ADI_SHIFT                     (1U)
#define CAAM_CICTL_ADI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_ADI_SHIFT)) & CAAM_CICTL_ADI_MASK)

#define CAAM_CICTL_DDI_MASK                      (0x4U)
#define CAAM_CICTL_DDI_SHIFT                     (2U)
#define CAAM_CICTL_DDI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_DDI_SHIFT)) & CAAM_CICTL_DDI_MASK)

#define CAAM_CICTL_PDI_MASK                      (0x40U)
#define CAAM_CICTL_PDI_SHIFT                     (6U)
#define CAAM_CICTL_PDI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_PDI_SHIFT)) & CAAM_CICTL_PDI_MASK)

#define CAAM_CICTL_MDI_MASK                      (0x80U)
#define CAAM_CICTL_MDI_SHIFT                     (7U)
#define CAAM_CICTL_MDI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_MDI_SHIFT)) & CAAM_CICTL_MDI_MASK)

#define CAAM_CICTL_CDI_MASK                      (0x100U)
#define CAAM_CICTL_CDI_SHIFT                     (8U)
#define CAAM_CICTL_CDI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_CDI_SHIFT)) & CAAM_CICTL_CDI_MASK)

#define CAAM_CICTL_RNDI_MASK                     (0x200U)
#define CAAM_CICTL_RNDI_SHIFT                    (9U)
#define CAAM_CICTL_RNDI(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_RNDI_SHIFT)) & CAAM_CICTL_RNDI_MASK)

#define CAAM_CICTL_AEI_MASK                      (0x20000U)
#define CAAM_CICTL_AEI_SHIFT                     (17U)
/*! AEI
 *  0b0..No AESA error detected
 *  0b1..AESA error detected
 */
#define CAAM_CICTL_AEI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_AEI_SHIFT)) & CAAM_CICTL_AEI_MASK)

#define CAAM_CICTL_DEI_MASK                      (0x40000U)
#define CAAM_CICTL_DEI_SHIFT                     (18U)
/*! DEI
 *  0b0..No DESA error detected
 *  0b1..DESA error detected
 */
#define CAAM_CICTL_DEI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_DEI_SHIFT)) & CAAM_CICTL_DEI_MASK)

#define CAAM_CICTL_PEI_MASK                      (0x400000U)
#define CAAM_CICTL_PEI_SHIFT                     (22U)
/*! PEI
 *  0b0..No PKHA error detected
 *  0b1..PKHA error detected
 */
#define CAAM_CICTL_PEI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_PEI_SHIFT)) & CAAM_CICTL_PEI_MASK)

#define CAAM_CICTL_MEI_MASK                      (0x800000U)
#define CAAM_CICTL_MEI_SHIFT                     (23U)
/*! MEI
 *  0b0..No MDHA error detected
 *  0b1..MDHA error detected
 */
#define CAAM_CICTL_MEI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_MEI_SHIFT)) & CAAM_CICTL_MEI_MASK)

#define CAAM_CICTL_CEI_MASK                      (0x1000000U)
#define CAAM_CICTL_CEI_SHIFT                     (24U)
/*! CEI
 *  0b0..No CRCA error detected
 *  0b1..CRCA error detected
 */
#define CAAM_CICTL_CEI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_CEI_SHIFT)) & CAAM_CICTL_CEI_MASK)

#define CAAM_CICTL_RNEI_MASK                     (0x2000000U)
#define CAAM_CICTL_RNEI_SHIFT                    (25U)
/*! RNEI
 *  0b0..No RNG error detected
 *  0b1..RNG error detected
 */
#define CAAM_CICTL_RNEI(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CICTL_RNEI_SHIFT)) & CAAM_CICTL_RNEI_MASK)
/*! @} */

/* The count of CAAM_CICTL */
#define CAAM_CICTL_COUNT                         (1U)

/*! @name CCWR - CCB 0 Clear Written Register */
/*! @{ */

#define CAAM_CCWR_C1M_MASK                       (0x1U)
#define CAAM_CCWR_C1M_SHIFT                      (0U)
/*! C1M
 *  0b0..Don't clear the Class 1 Mode Register.
 *  0b1..Clear the Class 1 Mode Register.
 */
#define CAAM_CCWR_C1M(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1M_SHIFT)) & CAAM_CCWR_C1M_MASK)

#define CAAM_CCWR_C1DS_MASK                      (0x4U)
#define CAAM_CCWR_C1DS_SHIFT                     (2U)
/*! C1DS
 *  0b0..Don't clear the Class 1 Data Size Register.
 *  0b1..Clear the Class 1 Data Size Register.
 */
#define CAAM_CCWR_C1DS(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1DS_SHIFT)) & CAAM_CCWR_C1DS_MASK)

#define CAAM_CCWR_C1ICV_MASK                     (0x8U)
#define CAAM_CCWR_C1ICV_SHIFT                    (3U)
/*! C1ICV
 *  0b0..Don't clear the Class 1 ICV Size Register.
 *  0b1..Clear the Class 1 ICV Size Register.
 */
#define CAAM_CCWR_C1ICV(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1ICV_SHIFT)) & CAAM_CCWR_C1ICV_MASK)

#define CAAM_CCWR_C1C_MASK                       (0x20U)
#define CAAM_CCWR_C1C_SHIFT                      (5U)
/*! C1C
 *  0b0..Don't clear the Class 1 Context Register.
 *  0b1..Clear the Class 1 Context Register.
 */
#define CAAM_CCWR_C1C(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1C_SHIFT)) & CAAM_CCWR_C1C_MASK)

