RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_CCSTA_LS_PB_MASK                    (0x40U)
#define CAAM_CCSTA_LS_PB_SHIFT                   (6U)
/*! PB
 *  0b0..PKHA Idle
 *  0b1..PKHA Busy
 */
#define CAAM_CCSTA_LS_PB(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_PB_SHIFT)) & CAAM_CCSTA_LS_PB_MASK)

#define CAAM_CCSTA_LS_MB_MASK                    (0x80U)
#define CAAM_CCSTA_LS_MB_SHIFT                   (7U)
/*! MB
 *  0b0..MDHA Idle
 *  0b1..MDHA Busy
 */
#define CAAM_CCSTA_LS_MB(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_MB_SHIFT)) & CAAM_CCSTA_LS_MB_MASK)

#define CAAM_CCSTA_LS_CB_MASK                    (0x100U)
#define CAAM_CCSTA_LS_CB_SHIFT                   (8U)
/*! CB
 *  0b0..CRCA Idle
 *  0b1..CRCA Busy
 */
#define CAAM_CCSTA_LS_CB(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_CB_SHIFT)) & CAAM_CCSTA_LS_CB_MASK)

#define CAAM_CCSTA_LS_RNB_MASK                   (0x200U)
#define CAAM_CCSTA_LS_RNB_SHIFT                  (9U)
/*! RNB
 *  0b0..RNG Idle
 *  0b1..RNG Busy
 */
#define CAAM_CCSTA_LS_RNB(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_RNB_SHIFT)) & CAAM_CCSTA_LS_RNB_MASK)

#define CAAM_CCSTA_LS_PDI_MASK                   (0x10000U)
#define CAAM_CCSTA_LS_PDI_SHIFT                  (16U)
/*! PDI
 *  0b0..Not Done
 *  0b1..Done Interrupt
 */
#define CAAM_CCSTA_LS_PDI(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_PDI_SHIFT)) & CAAM_CCSTA_LS_PDI_MASK)

#define CAAM_CCSTA_LS_SDI_MASK                   (0x20000U)
#define CAAM_CCSTA_LS_SDI_SHIFT                  (17U)
/*! SDI
 *  0b0..Not Done
 *  0b1..Done Interrupt
 */
#define CAAM_CCSTA_LS_SDI(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_SDI_SHIFT)) & CAAM_CCSTA_LS_SDI_MASK)

#define CAAM_CCSTA_LS_PEI_MASK                   (0x100000U)
#define CAAM_CCSTA_LS_PEI_SHIFT                  (20U)
/*! PEI
 *  0b0..No Error
 *  0b1..Error Interrupt
 */
#define CAAM_CCSTA_LS_PEI(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_PEI_SHIFT)) & CAAM_CCSTA_LS_PEI_MASK)

#define CAAM_CCSTA_LS_SEI_MASK                   (0x200000U)
#define CAAM_CCSTA_LS_SEI_SHIFT                  (21U)
/*! SEI
 *  0b0..No Error
 *  0b1..Error Interrupt
 */
#define CAAM_CCSTA_LS_SEI(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_SEI_SHIFT)) & CAAM_CCSTA_LS_SEI_MASK)

#define CAAM_CCSTA_LS_PRM_MASK                   (0x10000000U)
#define CAAM_CCSTA_LS_PRM_SHIFT                  (28U)
/*! PRM
 *  0b0..The given number is NOT prime.
 *  0b1..The given number is probably prime.
 */
#define CAAM_CCSTA_LS_PRM(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_PRM_SHIFT)) & CAAM_CCSTA_LS_PRM_MASK)

#define CAAM_CCSTA_LS_GCD_MASK                   (0x20000000U)
#define CAAM_CCSTA_LS_GCD_SHIFT                  (29U)
/*! GCD
 *  0b0..The greatest common divisor of two numbers is NOT one.
 *  0b1..The greatest common divisor of two numbers is one.
 */
#define CAAM_CCSTA_LS_GCD(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_GCD_SHIFT)) & CAAM_CCSTA_LS_GCD_MASK)

#define CAAM_CCSTA_LS_PIZ_MASK                   (0x40000000U)
#define CAAM_CCSTA_LS_PIZ_SHIFT                  (30U)
/*! PIZ
 *  0b0..The result of a Public Key operation is not zero.
 *  0b1..The result of a Public Key operation is zero.
 */
#define CAAM_CCSTA_LS_PIZ(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_PIZ_SHIFT)) & CAAM_CCSTA_LS_PIZ_MASK)
/*! @} */

/* The count of CAAM_CCSTA_LS */
#define CAAM_CCSTA_LS_COUNT                      (1U)

/*! @name CC1AADSZR - CCB 0 Class 1 AAD Size Register */
/*! @{ */

#define CAAM_CC1AADSZR_AASZ_MASK                 (0xFU)
#define CAAM_CC1AADSZR_AASZ_SHIFT                (0U)
#define CAAM_CC1AADSZR_AASZ(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CC1AADSZR_AASZ_SHIFT)) & CAAM_CC1AADSZR_AASZ_MASK)
/*! @} */

/* The count of CAAM_CC1AADSZR */
#define CAAM_CC1AADSZR_COUNT                     (1U)

/*! @name CC1IVSZR - CCB 0 Class 1 IV Size Register */
/*! @{ */

#define CAAM_CC1IVSZR_IVSZ_MASK                  (0xFU)
#define CAAM_CC1IVSZR_IVSZ_SHIFT                 (0U)
#define CAAM_CC1IVSZR_IVSZ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC1IVSZR_IVSZ_SHIFT)) & CAAM_CC1IVSZR_IVSZ_MASK)
/*! @} */

/* The count of CAAM_CC1IVSZR */
#define CAAM_CC1IVSZR_COUNT                      (1U)

/*! @name CPKASZR - PKHA A Size Register */
/*! @{ */

#define CAAM_CPKASZR_PKASZ_MASK                  (0x3FFU)
#define CAAM_CPKASZR_PKASZ_SHIFT                 (0U)
#define CAAM_CPKASZR_PKASZ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CPKASZR_PKASZ_SHIFT)) & CAAM_CPKASZR_PKASZ_MASK)
/*! @} */

/* The count of CAAM_CPKASZR */
#define CAAM_CPKASZR_COUNT                       (1U)

/*! @name CPKBSZR - PKHA B Size Register */
/*! @{ */

#define CAAM_CPKBSZR_PKBSZ_MASK                  (0x3FFU)
#define CAAM_CPKBSZR_PKBSZ_SHIFT                 (0U)
#define CAAM_CPKBSZR_PKBSZ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CPKBSZR_PKBSZ_SHIFT)) & CAAM_CPKBSZR_PKBSZ_MASK)
/*! @} */

/* The count of CAAM_CPKBSZR */
#define CAAM_CPKBSZR_COUNT                       (1U)

/*! @name CPKNSZR - PKHA N Size Register */
/*! @{ */

#define CAAM_CPKNSZR_PKNSZ_MASK                  (0x3FFU)
#define CAAM_CPKNSZR_PKNSZ_SHIFT                 (0U)
#define CAAM_CPKNSZR_PKNSZ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CPKNSZR_PKNSZ_SHIFT)) & CAAM_CPKNSZR_PKNSZ_MASK)
/*! @} */

/* The count of CAAM_CPKNSZR */
#define CAAM_CPKNSZR_COUNT                       (1U)

/*! @name CPKESZR - PKHA E Size Register */
/*! @{ */

#define CAAM_CPKESZR_PKESZ_MASK                  (0x3FFU)
#define CAAM_CPKESZR_PKESZ_SHIFT                 (0U)
#define CAAM_CPKESZR_PKESZ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CPKESZR_PKESZ_SHIFT)) & CAAM_CPKESZR_PKESZ_MASK)
/*! @} */

/* The count of CAAM_CPKESZR */
#define CAAM_CPKESZR_COUNT                       (1U)

/*! @name CC1CTXR - CCB 0 Class 1 Context Register Word 0..CCB 0 Class 1 Context Register Word 15 */
/*! @{ */

