RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CAAM.h
#define CAAM_DDDR_NSEQLSEL_MASK                  (0x3000000U)
#define CAAM_DDDR_NSEQLSEL_SHIFT                 (24U)
/*! NSEQLSEL
 *  0b01..SEQ DID
 *  0b10..Non-SEQ DID
 *  0b11..Trusted DID
 */
#define CAAM_DDDR_NSEQLSEL(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_NSEQLSEL_SHIFT)) & CAAM_DDDR_NSEQLSEL_MASK)

#define CAAM_DDDR_SEQLSEL_MASK                   (0xC000000U)
#define CAAM_DDDR_SEQLSEL_SHIFT                  (26U)
/*! SEQLSEL
 *  0b01..SEQ DID
 *  0b10..Non-SEQ DID
 *  0b11..Trusted DID
 */
#define CAAM_DDDR_SEQLSEL(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_SEQLSEL_SHIFT)) & CAAM_DDDR_SEQLSEL_MASK)

#define CAAM_DDDR_TRCT_MASK                      (0x30000000U)
#define CAAM_DDDR_TRCT_SHIFT                     (28U)
#define CAAM_DDDR_TRCT(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_TRCT_SHIFT)) & CAAM_DDDR_TRCT_MASK)

#define CAAM_DDDR_SD_MASK                        (0x40000000U)
#define CAAM_DDDR_SD_SHIFT                       (30U)
/*! SD
 *  0b0..This DECO has not received a shared descriptor from another DECO.
 *  0b1..This DECO has received a shared descriptor from another DECO.
 */
#define CAAM_DDDR_SD(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_SD_SHIFT)) & CAAM_DDDR_SD_MASK)

#define CAAM_DDDR_VALID_MASK                     (0x80000000U)
#define CAAM_DDDR_VALID_SHIFT                    (31U)
/*! VALID
 *  0b0..No descriptor is currently running in this DECO.
 *  0b1..There is currently a descriptor running in this DECO.
 */
#define CAAM_DDDR_VALID(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_VALID_SHIFT)) & CAAM_DDDR_VALID_MASK)
/*! @} */

/* The count of CAAM_DDDR */
#define CAAM_DDDR_COUNT                          (1U)

/*! @name DDJP - DECO0 Debug Job Pointer */
/*! @{ */

#define CAAM_DDJP_JDPTR_MASK                     (0xFFFFFFFFFU)
#define CAAM_DDJP_JDPTR_SHIFT                    (0U)
#define CAAM_DDJP_JDPTR(x)                       (((uint64_t)(((uint64_t)(x)) << CAAM_DDJP_JDPTR_SHIFT)) & CAAM_DDJP_JDPTR_MASK)
/*! @} */

/* The count of CAAM_DDJP */
#define CAAM_DDJP_COUNT                          (1U)

/*! @name DSDP - DECO0 Debug Shared Pointer */
/*! @{ */

#define CAAM_DSDP_SDPTR_MASK                     (0xFFFFFFFFFU)
#define CAAM_DSDP_SDPTR_SHIFT                    (0U)
#define CAAM_DSDP_SDPTR(x)                       (((uint64_t)(((uint64_t)(x)) << CAAM_DSDP_SDPTR_SHIFT)) & CAAM_DSDP_SDPTR_MASK)
/*! @} */

/* The count of CAAM_DSDP */
#define CAAM_DSDP_COUNT                          (1U)

/*! @name DDDR_MS - DECO0 Debug DID, most-significant half */
/*! @{ */

#define CAAM_DDDR_MS_PRIM_DID_MASK               (0xFU)
#define CAAM_DDDR_MS_PRIM_DID_SHIFT              (0U)
#define CAAM_DDDR_MS_PRIM_DID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_MS_PRIM_DID_SHIFT)) & CAAM_DDDR_MS_PRIM_DID_MASK)

#define CAAM_DDDR_MS_PRIM_TZ_MASK                (0x10U)
#define CAAM_DDDR_MS_PRIM_TZ_SHIFT               (4U)
/*! PRIM_TZ
 *  0b0..TrustZone NonSecureWorld
 *  0b1..TrustZone SecureWorld
 */
#define CAAM_DDDR_MS_PRIM_TZ(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_MS_PRIM_TZ_SHIFT)) & CAAM_DDDR_MS_PRIM_TZ_MASK)

#define CAAM_DDDR_MS_PRIM_ICID_MASK              (0xFFE0U)
#define CAAM_DDDR_MS_PRIM_ICID_SHIFT             (5U)
#define CAAM_DDDR_MS_PRIM_ICID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_MS_PRIM_ICID_SHIFT)) & CAAM_DDDR_MS_PRIM_ICID_MASK)

#define CAAM_DDDR_MS_OUT_DID_MASK                (0xF0000U)
#define CAAM_DDDR_MS_OUT_DID_SHIFT               (16U)
#define CAAM_DDDR_MS_OUT_DID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_MS_OUT_DID_SHIFT)) & CAAM_DDDR_MS_OUT_DID_MASK)

#define CAAM_DDDR_MS_OUT_ICID_MASK               (0xFFE00000U)
#define CAAM_DDDR_MS_OUT_ICID_SHIFT              (21U)
#define CAAM_DDDR_MS_OUT_ICID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_MS_OUT_ICID_SHIFT)) & CAAM_DDDR_MS_OUT_ICID_MASK)
/*! @} */

/* The count of CAAM_DDDR_MS */
#define CAAM_DDDR_MS_COUNT                       (1U)

/*! @name DDDR_LS - DECO0 Debug DID, least-significant half */
/*! @{ */

#define CAAM_DDDR_LS_OUT_DID_MASK                (0xFU)
#define CAAM_DDDR_LS_OUT_DID_SHIFT               (0U)
#define CAAM_DDDR_LS_OUT_DID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_LS_OUT_DID_SHIFT)) & CAAM_DDDR_LS_OUT_DID_MASK)

#define CAAM_DDDR_LS_OUT_ICID_MASK               (0x3FF80000U)
#define CAAM_DDDR_LS_OUT_ICID_SHIFT              (19U)
#define CAAM_DDDR_LS_OUT_ICID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DDDR_LS_OUT_ICID_SHIFT)) & CAAM_DDDR_LS_OUT_ICID_MASK)
/*! @} */

/* The count of CAAM_DDDR_LS */
#define CAAM_DDDR_LS_COUNT                       (1U)

/*! @name SOL - Sequence Output Length Register */
/*! @{ */

#define CAAM_SOL_SOL_MASK                        (0xFFFFFFFFU)
#define CAAM_SOL_SOL_SHIFT                       (0U)
#define CAAM_SOL_SOL(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_SOL_SOL_SHIFT)) & CAAM_SOL_SOL_MASK)
/*! @} */

/* The count of CAAM_SOL */
#define CAAM_SOL_COUNT                           (1U)

/*! @name VSOL - Variable Sequence Output Length Register */
/*! @{ */

#define CAAM_VSOL_VSOL_MASK                      (0xFFFFFFFFU)
#define CAAM_VSOL_VSOL_SHIFT                     (0U)
#define CAAM_VSOL_VSOL(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_VSOL_VSOL_SHIFT)) & CAAM_VSOL_VSOL_MASK)
/*! @} */

/* The count of CAAM_VSOL */
#define CAAM_VSOL_COUNT                          (1U)

/*! @name SIL - Sequence Input Length Register */
/*! @{ */

#define CAAM_SIL_SIL_MASK                        (0xFFFFFFFFU)
#define CAAM_SIL_SIL_SHIFT                       (0U)
#define CAAM_SIL_SIL(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_SIL_SIL_SHIFT)) & CAAM_SIL_SIL_MASK)
/*! @} */

/* The count of CAAM_SIL */
#define CAAM_SIL_COUNT                           (1U)

/*! @name VSIL - Variable Sequence Input Length Register */
/*! @{ */

